app/controllers/attendances_controller.rb

  def search_member
    if (params[:name]!='' && params[:last_name]!='' )
      #@members=Member.find(:all, :conditions=>['name LIKE ? OR last_name LIKE ?', "%#{params[:name]}%", "%#{params[:last_name]}%"])
	  @members=Member.where("name LIKE ? OR last_name LIKE ?", "%#{params[:name]}%", "%#{params[:last_name]}%")
---
SELECT * FROM `members` WHERE (name LIKE '%osa%' OR last_name LIKE '%ruiz%')

  def today
    #@attendances = Attendance.find(:all, :conditions=>['created_at > ? AND created_at < ?', Date.today, Date.today+1], :order=>'created_at DESC')
	@attendances = Attendance.where("created_at > ?  AND created_at < ?", Date.today, Date.today+1).order('created_at DESC')
---
SELECT * FROM `attendances` WHERE (created_at > '2010-02-08' AND created_at < '2010-02-09') ORDER BY created_at DESC

  def day
    @date=params[:date].to_date
    if @date==Date.today
      redirect_to(:action=>"today")
    else
      session[:image]='calendar.png'
      #@attendances = Attendance.find(:all, :conditions=>['created_at > ? AND created_at < ?', @date, @date+1], :order=>'created_at DESC')
	  @attendances = Attendance.where('created_at > ? AND created_at < ?',  @date, @date+1).order('created_at DESC')
---
SELECT * FROM `attendances` WHERE (created_at > '2010-02-10' AND created_at < '2010-02-11') ORDER BY created_at DESC

  def show
    @attendance = Attendance.find(params[:id])
---
SELECT * FROM `attendances` WHERE (`attendances`.`id` = 29)

  def create
    #@attendance = Attendance.new(params[:attendance])

    if Membership.exists?(params[:membership])
      membership=Membership.find(params[:membership])
      @attendance=Attendance.new(:member_id=>membership.member.id)
      @attendance.save
      #@attendances = Attendance.find(:all, :conditions=>['created_at > ? AND created_at < ?', Date.today, Date.today+1], :order=>'created_at DESC')
	  @attendances = Attendance.where('created_at > ? AND created_at < ?', Date.today, Date.today+1).order('created_at DESC')
---
SELECT * FROM `memberships` WHERE (`memberships`.member_id = 15) LIMIT 1
SELECT `memberships`.id FROM `memberships` WHERE (`memberships`.`id` = '888') LIMIT 1
INSERT INTO `attendances` (`updated_at`, `member_id`, `created_at`) VALUES('2009-11-07 09:06:56', 15, '2009-11-07 09:06:56')
SELECT * FROM `attendances` WHERE (created_at > '2010-02-09' AND created_at < '2010-02-10') ORDER BY created_at DESC

  def destroy
    @attendance = Attendance.find(params[:id])
    @attendance.destroy
---
SELECT * FROM `attendances` WHERE (`attendances`.`id` = 29)
DELETE FROM `attendances` WHERE `id` = 29