app/controllers/attendances_controller.rb

  def index
    @attendances = Attendance.all
---
SELECT * FROM `attendances` ORDER BY created_at DESC