app/controllers/members_controller.rb

  def index
    @members = Member.all
---
SELECT * FROM `members` WHERE (created_at >= '2009-11-07')

  def show_member
    @member = Member.find(params[:id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 1)

  def edit
    @member = Member.find(params[:id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 13)

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT * FROM `members` WHERE (`members`.`id` = 13)
DELETE FROM `members` WHERE `id` = 13