app/controllers/memberships_controller.rb

  def index
    session[:title]='Membres&iacute;as'
    session[:image]='members.png'
    @memberships = Membership.all
    @rates = Rate.all
---
SELECT * FROM `memberships`
SELECT * FROM `rates`

  def show
    @membership = Membership.find(params[:id])
---
SELECT * FROM `memberships` WHERE (`memberships`.`id` = 8)

  def edit
    @membership = Membership.find(params[:id])
---
SELECT * FROM `memberships` WHERE (`memberships`.`id` = 9)

  def create
    @membership = Membership.new(:rate_id=>params[:membership][:rate_id].to_i, :pending_months=>params[:membership][:pending_months], :pay_day=>params[:membership][:pay_day])
    @member=Member.new(params[:membership][:member])
    @member.save
    @membership.member_id=@member.id

    respond_to do |format|
      if @membership.save
      	    if params[:paid]
    			@payment=Payment.new(:membership_id=>@membership.id, :rate_id=>@membership.rate_id, :paid_month=>Date.today.month, :paid_year=>Date.today.year)
    			@payment.save
---
INSERT INTO `members` (`name`, `updated_at`, `photo_file_name`, `photo_file_size`, `created_by`, `photo_updated_at`, `is_female`, `photo_content_type`, `phone`, `member_number`, `last_name`, `address`, `email`, `created_at`) VALUES('megan', '2010-03-14 05:38:38', '701065.jpg', 46530, NULL, '2010-03-14 05:38:37', NULL, 'image/jpeg', '0909809', NULL, 'Fox', 'Filosofos', 'albertordz@gmail.com', '2010-03-14 05:38:38')
INSERT INTO `memberships` (`updated_at`, `member_id`, `rate_id`, `group_id`, `pending_months`, `pay_day`, `created_at`, `active`) VALUES('2010-03-14 21:54:06', NULL, 1, NULL, NULL, 14, '2010-03-14 21:54:06', 1)
INSERT INTO `payments` (`updated_at`, `membership_id`, `rate_id`, `paid_year`, `paid_month`, `created_at`) VALUES('2010-03-14 21:54:50', 17, 1, 14, 3, '2010-03-14 21:54:50')

  def update
    @membership = Membership.find(params[:id])
    @member=Member.find(@membership.member_id.to_i)
    @member.update_attributes(params[:membership][:member])
---
SELECT * FROM `memberships` WHERE (`memberships`.`id` = 9)
SELECT * FROM `members` WHERE (`members`.`id` = 24)
UPDATE `members` SET `photo_updated_at` = '2009-11-08 09:07:04', `updated_at` = '2009-11-08 09:07:04', `photo_file_size` = 133637, `photo_file_name` = 'Picture_2.png' WHERE `id` = 24
UPDATE `memberships` SET `rate_id` = 2, `updated_at` = '2009-11-08 09:07:04' WHERE `id` = 9

  def destroy
    @membership = Membership.find(params[:id])
    @payments = Payment.find(:all, :conditions=> "membership_id=#{@membership.id}")
    @membership.destroy
---
SELECT * FROM `memberships` WHERE (`memberships`.`id` = 22)
DELETE FROM `memberships` WHERE `id` = 22