app/controllers/payments_controller.rb

  def index
    session[:title]='Pagos'
    session[:image]='members.png'

    @payments = Payment.all
---
SELECT * FROM `payments`

  def show
    @payment = Payment.find(params[:id])
---
SELECT * FROM `payments` WHERE (`payments`.`id` = 2)

  def edit
    @payment = Payment.find(params[:id])
---
SELECT * FROM `payments` WHERE (`payments`.`id` = 2)

  def create
    @payment = Payment.new(params[:payment])

    respond_to do |format|
      if @payment.save
---
INSERT INTO `payments` (`updated_at`, `membership_id`, `rate_id`, `paid_year`, `paid_month`, `created_at`) VALUES('2010-10-20 06:03:23', 28, 1, 2010, 10, '2010-10-20 06:03:23')