app/controllers/rates_controller.rb

  def index
    @rates = Rate.all
---
SELECT * FROM `rates`

  def show
    @rate = Rate.find(params[:id])
---
SELECT * FROM `rates` WHERE (`rates`.`id` = 1)

  def create
    @rate = Rate.new(params[:rate])

    respond_to do |format|
      if @rate.save
---
INSERT INTO `rates` (`name`, `updated_at`, `price`, `created_at`) VALUES('Estudiantes', '2010-02-09 16:27:48', 300.0, '2010-02-09 16:27:48')