app/controllers/reports_controller.rb

  def all_pending
  		@pending_months = PendingMonth.all
  		@memberships = Membership.all
---
SELECT * FROM `pending_months` WHERE (`pending_months`.membership_id = 6)
SELECT * FROM `memberships`