app/controllers/sessions_controller.rb

def authenticate
  	@user=User.find_by_username(params[:username])
---
SELECT * FROM `users` WHERE (`users`.`username` = 'albertordz') LIMIT 1