app/controllers/users_controller.rb

  def index
  	session[:title]='Lista de usuarios'
    session[:image]='members.png'

    @users = User.all
---
SELECT * FROM `users`

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `username`, `role`, `landing_page`, `password`, `last_name`, `created_at`, `email`) VALUES('alberto', NULL, '2010-02-22 17:48:37', 'albertordz', 1, 'attendances/today', 'alberto', 'rodriguez', '2010-02-22 17:48:37', 'albertordz@gmail.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `role` = 2, `updated_at` = '2010-02-22 22:05:23' WHERE `id` = 1